#+STARTUP: indent hidestars contents logdrawer
#+TITLE: Master 2 Thesis
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
* Progress Timetable 
I keep this table to prevent falling behind deadlines. The estimations are
taken from Beaud's /L'art de la these/; they are good enough for the French
system, in which a M2 Master's thesis should be prepared in one year.

#+ATTR_LATEX: :environment tabular :booktabs :align clcc :caption \captionabove{Calendar for preparing a Master's thesis.}
| Stage        | Task                   | Spent | Remaining |
|--------------+------------------------+-------+-----------|
| Pre-research |                        |     4 |         4 |
|--------------+------------------------+-------+-----------|
|              | Choice: Subject-matter |     0 |         0 |
|              | First Sifting          |     0 |         2 |
|              | Draft: Research Proposal |     0 |         0 |
|--------------+------------------------+-------+-----------|
| Research     |                        |    14 |        14 |
|--------------+------------------------+-------+-----------|
|              | Research Proposal |     0 |         0 |
|              | Research Plan          |     0 |         0 |
|              | Research               |     0 |         0 |
| Pre-writing  |                        |     0 |         0 |
|              | Draft: Writing Proposal |     0 |         0 |
|              | Draft: Writing Plan    |     0 |         0 |
|              | Additional Research    |     0 |         0 |
|--------------+------------------------+-------+-----------|
| Writing      |                        |    11 |        11 |
|--------------+------------------------+-------+-----------|
|              | Exploratory Draft      |     0 |         0 |
|              | Writing Proposal |     0 |         0 |
|              | Writing Plan           |     0 |         0 |
|              | First Draft            |     0 |         0 |
|              | Last Draft             |     0 |         0 |
|              | Final Version          |     0 |         0 |
|--------------+------------------------+-------+-----------|
| Jury         |                        |     2 |         2 |
|--------------+------------------------+-------+-----------|
|              | Adviser Agreement      |     0 |         0 |
|              | Fine Tuning            |     0 |         1 |
|              | Printing               |     0 |         0 |
|              | Due Diligence          |     0 |         0 |
|              | Jury                   |     0 |         0 |
|--------------+------------------------+-------+-----------|
|              | Total (週)             |  0.00 |     31.00 |
|              | Total  (月)            |  0.00 |      7.75 |
#+TBLFM: @>>$3..@>>$>=vsum(@2..@-2);%.2f::@>$3..@>$>=(vsum(@2..@-2))/4;%.2f::@<<$>>..@>>>$>>=$>-$>>>;%.0f::

# Since the table is coded with Emacs' ~org-mode~, it is interactive. Just type
# the number of weeks spent in each stage under the ~Spent~ column, and the
# rest will adjust (with ~C-c C-c~) to display the remaining weeks and months.
